# GetOutline Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PolyLine..::..GetOutline Method
PolyLine Class See Also
---
Gets the outline of the polyline.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Outline GetOutline()
```

Visual Basic
---
```text
Public Function GetOutline As Outline
```

Visual C++
---
```text
public:
Outline^ GetOutline()
```

# See Also
PolyLine Class
Autodesk.Revit.DB Namespace